Catalogs/упСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяИндивидуальныйГрафикРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМагнитнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПодразделенияПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникЧислитсяВНесколькихОрганизациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упТипыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Водитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВодительЭкспедитор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Курьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Механик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оператор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспедитор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упГаражи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГаражи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьРасписаниеРаботыГаража</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПредупрежденияОТОДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПредупрежденияОТОМоточасы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПредупрежденияОТОПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упСотрудники/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ПеременныеМодуляФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОВ",?(Параметры.Свойство("ТС"),Параметры.ТС.ОсновнойВодитель, Справочники.упСотрудники.ПустаяСсылка()));	
	Список.Параметры.УстановитьЗначениеПараметра("ВОВ",?(Параметры.Свойство("ТС"),Параметры.ТС.ВторойОсновнойВодитель, Справочники.упСотрудники.ПустаяСсылка()));	
	Список.Параметры.УстановитьЗначениеПараметра("ОЭ",?(Параметры.Свойство("ТС"),Параметры.ТС.ОсновнойЭкспедитор, Справочники.упСотрудники.ПустаяСсылка()));	
	
	ПарметрыИспользованияВыбора = Новый Структура();
	
	Если Параметры.Свойство("Гараж") Тогда
		ПарметрыИспользованияВыбора.Вставить("Гараж", Параметры.Гараж);
	КонецЕсли;
	Если Параметры.Свойство("Механик") Тогда
		ПарметрыИспользованияВыбора.Вставить("Механик", Параметры.Механик);
	КонецЕсли;
	Если Параметры.Свойство("ТС") Тогда
		ПарметрыИспользованияВыбора.Вставить("ТС", Параметры.ТС);
	КонецЕсли;
	Если Параметры.Свойство("Перевозчик") Тогда
		ПарметрыИспользованияВыбора.Вставить("Перевозчик", Параметры.Перевозчик);
	КонецЕсли;
	Если Параметры.Свойство("Отбор") Тогда
		ОтборВходящий = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Параметры.Отбор);
		ПарметрыИспользованияВыбора.Вставить("Отбор", ОтборВходящий);
		Параметры.Отбор.Очистить();
	КонецЕсли;
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПарметрыИспользованияВыбора, УникальныйИдентификатор);
	
	УстановитьПараметрыДляФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ЗаписанСотрудник" Тогда
		Если ТипЗнч(Параметр)=ТИП("Структура") Тогда
			Если Параметр.Свойство("ЭтоНовый") Тогда
				Если Параметр.ЭтоНовый Тогда
					Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
					Список.УсловноеОформление.Элементы.Очистить();
					УстановитьПараметрыДляФормы();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыДляФормы()
	
	ПарметрыИспользованияВыбора = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	Если ПарметрыИспользованияВыбора.Свойство("Отбор") Тогда
		СписокТипов = Новый Массив;
		СписокТипов.Добавить(ТИП("Массив"));
		СписокТипов.Добавить(ТИП("ФиксированныйМассив"));
		Для каждого ЭлементСтруктуры Из ПарметрыИспользованияВыбора.Отбор Цикл
			ТекущееЗначение = ЭлементСтруктуры.Значение;
			Если НЕ СписокТипов.Найти(ТипЗнч(ТекущееЗначение))=Неопределено Тогда
				ТекущееЗначение = Новый СписокЗначений();
				Для каждого ЗначениеЭлемента Из ЭлементСтруктуры.Значение Цикл
					ТекущееЗначение.Добавить(ЗначениеЭлемента,,Истина);
				КонецЦикла;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, ЭлементСтруктуры.Ключ, ТекущееЗначение);
		КонецЦикла;
	КонецЕсли;
	Если ПарметрыИспользованияВыбора.Свойство("Перевозчик") Тогда
		СписокСотрудников = ПолучитьСотрудников(ПарметрыИспользованияВыбора.Перевозчик);
		Если СписокСотрудников.Количество() Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Ссылка", СписокСотрудников);
		Иначе
			Если ЗначениеЗаполнено(ПарметрыИспользованияВыбора.Перевозчик) Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Партнер", ПарметрыИспользованияВыбора.Перевозчик);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Гараж = Неопределено;
	
	Если Истина
		И ПарметрыИспользованияВыбора.Свойство("Гараж", Гараж)
		И ПарметрыИспользованияВыбора.Свойство("Механик")
		И ЗначениеЗаполнено(Гараж)
	Тогда
		ГруппаОтбораСотрудников = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, , ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбораСотрудников, "ТипСотрудника", Перечисления.упТипыСотрудников.Механик);
		ГруппаОтбораВодителейГаража = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаОтбораСотрудников, , ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбораВодителейГаража, "ТипСотрудника", Перечисления.упТипыСотрудников.Водитель);
		мсвСотрудникиГаража = СотрудникиГаража(Гараж);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбораВодителейГаража, "Ссылка", мсвСотрудникиГаража);
	КонецЕсли;

КонецПроцедуры // УстановитьПараметрыДляФормы()

&НаСервереБезКонтекста
// Получим список сотрудников
//
// Параметры:
//  Перевозчик  - СправочникСсылка.упПартнеры - Ссылка на перевозчика.
//
// Возвращаемое значение:
//   СписокЗначений   - Ссылки на сотрудников.
//
Функция ПолучитьСотрудников(Перевозчик)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Перевозчик);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упСотрудники.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(упСотрудники.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.упСотрудники КАК упСотрудники
	|ГДЕ упСотрудники.СотрудникЧислитсяВНесколькихОрганизациях ИЛИ упСотрудники.Партнер = &Партнер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокЗначений = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Ссылка,Выборка.Представление);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции // ПолучитьСотрудников()

&НаСервереБезКонтекста
Функция СотрудникиГаража(Гараж)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Гараж);
	Запрос.Текст = "ВЫБРАТЬ
	|	упГаражиСотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.упГаражи.Сотрудники КАК упГаражиСотрудники
	|ГДЕ
	|	упГаражиСотрудники.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	Возврат Результат;	
	
КонецФункции

#КонецОбласти
